Applying **Development**:

```diff
Acquiring state lock. This may take a few moments...
module.complete.data.archive_file.lambda_zip: Reading...
module.complete.data.archive_file.lambda_zip: Read complete after 0s [id=7517866eb05f876f45c1f92f4725f6c55a51fdd7]
data.http.my_public_ip: Reading...
module.complete.data.http.my_public_ip: Reading...
module.complete.data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
module.complete.data.aws_availability_zones.available: Reading...
module.complete.data.aws_region.current: Reading...
module.complete.data.aws_ami_ids.sfos: Reading...
data.aws_availability_zones.available: Reading...
module.complete.data.aws_iam_policy_document.trust_relationship: Reading...
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
module.complete.data.aws_caller_identity.current: Reading...
module.complete.data.aws_caller_identity.current: Read complete after 0s [id=447552758530]
module.complete.data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zone.available["us-west-1c"]: Reading...
data.aws_availability_zone.available["us-west-1b"]: Reading...
data.aws_availability_zone.available["us-west-1b"]: Read complete after 0s [id=us-west-1b]
data.aws_availability_zone.available["us-west-1c"]: Read complete after 0s [id=us-west-1c]
module.complete.data.aws_ami_ids.sfos: Read complete after 1s [id=1726762986]
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-037703324ef265430"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0d7615ce54a8138e1"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Read complete after 0s [id=ami-0fb2a8cf2684fdb0c]
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Read complete after 0s [id=ami-0f37b9b5182756d01]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Read complete after 0s [id=ami-03cbb6f8e3173ca7a]
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Read complete after 0s [id=ami-091558582143f9648]
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-037703324ef265430"]: Read complete after 0s [id=ami-037703324ef265430]
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Read complete after 0s [id=ami-0b68236d144f48351]
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Read complete after 0s [id=ami-065fabeba927f04d3]
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Read complete after 0s [id=ami-0eafce265f8e28d06]
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Read complete after 0s [id=ami-053dbe57dfe422765]
module.complete.data.aws_ami.dynamic_ami["ami-0d7615ce54a8138e1"]: Read complete after 0s [id=ami-0d7615ce54a8138e1]
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Read complete after 0s [id=ami-030bf19f87a227c8a]
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Read complete after 0s [id=ami-026c32ba32c93b8c4]
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Read complete after 0s [id=ami-04b0be28f678af9ee]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Read complete after 0s [id=ami-0442ca42ae7162b75]
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Read complete after 0s [id=ami-059bf44c0f5e904d9]
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Read complete after 0s [id=ami-07186848dc5aa7580]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 1
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
+       prefix      = "example-complete"
    }

  # module.complete.data.aws_iam_policy_document.ec2_iam_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ec2_iam_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "secretsmanager:DescribeSecret",
+               "secretsmanager:GetSecretValue",
            ]
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
        }
    }

  # module.complete.data.aws_iam_policy_document.secure_storage_master_key will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "secure_storage_master_key" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "secretsmanager:DescribeSecret",
+               "secretsmanager:GetSecretValue",
            ]
+           resources = [
+               (known after apply),
            ]
        }
    }

  # module.complete.data.template_file.user_data will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "user_data" {
+       id       = (known after apply)
+       rendered = (known after apply)
+       template = "{%{~ if s3bucket != \"\" ~}\"s3bucket\":\"${s3bucket}\",%{~ endif ~}%{~ if centralusername != \"\" ~}\"centralusername\":\"${centralusername}\",\"centralsecretId\":\"${centralsecretId}\",%{~ endif ~}%{~ if serialKey != \"\" ~}\"serialKey\":\"${serialKey}\",%{~ endif ~}\"ssmkSecretId\":\"${ssmkSecretId}\",\"hostname\":\"${hostname}\",\"sendstats\": \"${sendstats}\",\"region\":\"${region}\",\"secretId\":\"${secretId}\",\"configSecretId\":\"${configSecretId}\"}"
+       vars     = {
+           "centralpassword" = null
+           "centralusername" = ""
+           "configSecretId"  = (known after apply)
+           "hostname"        = "sophos-xg-terraform"
+           "region"          = "us-west-1"
+           "s3bucket"        = ""
+           "secretId"        = (known after apply)
+           "sendstats"       = "on"
+           "serialKey"       = ""
+           "ssmkSecretId"    = (known after apply)
        }
    }

  # module.complete.aws_eip.this[0] will be created
+   resource "aws_eip" "this" {
+       allocation_id             = (known after apply)
+       associate_with_private_ip = (known after apply)
+       association_id            = (known after apply)
+       carrier_ip                = (known after apply)
+       customer_owned_ip         = (known after apply)
+       domain                    = (known after apply)
+       id                        = (known after apply)
+       instance                  = (known after apply)
+       network_border_group      = (known after apply)
+       network_interface         = (known after apply)
+       private_dns               = (known after apply)
+       private_ip                = (known after apply)
+       public_dns                = (known after apply)
+       public_ip                 = (known after apply)
+       public_ipv4_pool          = (known after apply)
+       tags                      = (known after apply)
+       tags_all                  = (known after apply)
+       vpc                       = true
    }

  # module.complete.aws_iam_instance_profile.this will be created
+   resource "aws_iam_instance_profile" "this" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       path        = "/"
+       role        = (known after apply)
+       tags        = (known after apply)
+       tags_all    = (known after apply)
+       unique_id   = (known after apply)
    }

  # module.complete.aws_iam_role.lambda_execution_role will be created
+   resource "aws_iam_role" "lambda_execution_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "lambda.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.complete.aws_iam_role.this will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = (known after apply)
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.complete.aws_instance.this will be created
+   resource "aws_instance" "this" {
+       ami                                  = (known after apply)
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = false
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = (known after apply)
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = true
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       subnet_id                            = (known after apply)
+       tags                                 = (known after apply)
+       tags_all                             = (known after apply)
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)

+       capacity_reservation_specification {
+           capacity_reservation_preference = (known after apply)

+           capacity_reservation_target {
+               capacity_reservation_id                 = (known after apply)
+               capacity_reservation_resource_group_arn = (known after apply)
            }
        }

+       ebs_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           snapshot_id           = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }

+       enclave_options {
+           enabled = (known after apply)
        }

+       ephemeral_block_device {
+           device_name  = (known after apply)
+           no_device    = (known after apply)
+           virtual_name = (known after apply)
        }

+       launch_template {
+           id      = (known after apply)
+           name    = (known after apply)
+           version = "$Latest"
        }

+       maintenance_options {
+           auto_recovery = (known after apply)
        }

+       metadata_options {
+           http_endpoint               = "enabled"
+           http_put_response_hop_limit = 1
+           http_tokens                 = "required"
+           instance_metadata_tags      = "enabled"
        }

+       network_interface {
+           delete_on_termination = (known after apply)
+           device_index          = (known after apply)
+           network_card_index    = (known after apply)
+           network_interface_id  = (known after apply)
        }

+       private_dns_name_options {
+           enable_resource_name_dns_a_record    = (known after apply)
+           enable_resource_name_dns_aaaa_record = (known after apply)
+           hostname_type                        = (known after apply)
        }

+       root_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }
    }

  # module.complete.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = (known after apply)
+       tags_all = (known after apply)
+       vpc_id   = (known after apply)
    }

  # module.complete.aws_lambda_function.this will be created
+   resource "aws_lambda_function" "this" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       filename                       = "../../initial_config.zip"
+       function_name                  = (known after apply)
+       handler                        = "config.main"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       memory_size                    = 128
+       package_type                   = "Zip"
+       publish                        = false
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = (known after apply)
+       runtime                        = "python3.7"
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags_all                       = (known after apply)
+       timeout                        = 3
+       version                        = (known after apply)

+       environment {
+           variables = (known after apply)
        }

+       ephemeral_storage {
+           size = (known after apply)
        }

+       tracing_config {
+           mode = (known after apply)
        }

+       vpc_config {
+           security_group_ids = (known after apply)
+           subnet_ids         = (known after apply)
+           vpc_id             = (known after apply)
        }
    }

  # module.complete.aws_launch_template.this will be created
+   resource "aws_launch_template" "this" {
+       arn             = (known after apply)
+       default_version = (known after apply)
+       id              = (known after apply)
+       image_id        = "ami-0f37b9b5182756d01"
+       instance_type   = "t3.medium"
+       key_name        = (known after apply)
+       latest_version  = (known after apply)
+       name            = (known after apply)
+       name_prefix     = (known after apply)
+       tags            = (known after apply)
+       tags_all        = (known after apply)
+       user_data       = (known after apply)

+       block_device_mappings {
+           device_name = "/dev/xvda"

+           ebs {
+               delete_on_termination = "true"
+               encrypted             = "false"
+               iops                  = (known after apply)
+               throughput            = (known after apply)
+               volume_size           = 16
+               volume_type           = "gp2"
            }
        }
+       block_device_mappings {
+           device_name = "/dev/xvdg"

+           ebs {
+               delete_on_termination = "true"
+               encrypted             = "false"
+               iops                  = (known after apply)
+               throughput            = (known after apply)
+               volume_size           = 80
+               volume_type           = "gp2"
            }
        }

+       iam_instance_profile {
+           name = (known after apply)
        }

+       metadata_options {
+           http_endpoint               = "enabled"
+           http_protocol_ipv6          = "disabled"
+           http_put_response_hop_limit = 1
+           http_tokens                 = "required"
+           instance_metadata_tags      = "enabled"
        }

+       network_interfaces {
+           device_index         = 1
+           network_interface_id = (known after apply)
        }
+       network_interfaces {
+           device_index         = 0
+           network_interface_id = (known after apply)
        }
    }

  # module.complete.aws_network_interface.private will be created
+   resource "aws_network_interface" "private" {
+       arn                       = (known after apply)
+       description               = "ENI for Private Subnet"
+       id                        = (known after apply)
+       interface_type            = (known after apply)
+       ipv4_prefix_count         = (known after apply)
+       ipv4_prefixes             = (known after apply)
+       ipv6_address_count        = (known after apply)
+       ipv6_address_list         = (known after apply)
+       ipv6_address_list_enabled = false
+       ipv6_addresses            = (known after apply)
+       ipv6_prefix_count         = (known after apply)
+       ipv6_prefixes             = (known after apply)
+       mac_address               = (known after apply)
+       outpost_arn               = (known after apply)
+       owner_id                  = (known after apply)
+       private_dns_name          = (known after apply)
+       private_ip                = (known after apply)
+       private_ip_list           = (known after apply)
+       private_ip_list_enabled   = false
+       private_ips               = (known after apply)
+       private_ips_count         = (known after apply)
+       security_groups           = (known after apply)
+       source_dest_check         = false
+       subnet_id                 = (known after apply)
+       tags                      = (known after apply)
+       tags_all                  = (known after apply)

+       attachment {
+           attachment_id = (known after apply)
+           device_index  = (known after apply)
+           instance      = (known after apply)
        }
    }

  # module.complete.aws_network_interface.public will be created
+   resource "aws_network_interface" "public" {
+       arn                       = (known after apply)
+       description               = "ENI for Public Subnet"
+       id                        = (known after apply)
+       interface_type            = (known after apply)
+       ipv4_prefix_count         = (known after apply)
+       ipv4_prefixes             = (known after apply)
+       ipv6_address_count        = (known after apply)
+       ipv6_address_list         = (known after apply)
+       ipv6_address_list_enabled = false
+       ipv6_addresses            = (known after apply)
+       ipv6_prefix_count         = (known after apply)
+       ipv6_prefixes             = (known after apply)
+       mac_address               = (known after apply)
+       outpost_arn               = (known after apply)
+       owner_id                  = (known after apply)
+       private_dns_name          = (known after apply)
+       private_ip                = (known after apply)
+       private_ip_list           = (known after apply)
+       private_ip_list_enabled   = false
+       private_ips               = (known after apply)
+       private_ips_count         = (known after apply)
+       security_groups           = (known after apply)
+       source_dest_check         = false
+       subnet_id                 = (known after apply)
+       tags                      = (known after apply)
+       tags_all                  = (known after apply)

+       attachment {
+           attachment_id = (known after apply)
+           device_index  = (known after apply)
+           instance      = (known after apply)
        }
    }

  # module.complete.aws_route.private will be created
+   resource "aws_route" "private" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.complete.aws_route.public will be created
+   resource "aws_route" "public" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.complete.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = (known after apply)
+       tags_all         = (known after apply)
+       vpc_id           = (known after apply)
    }

  # module.complete.aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = (known after apply)
+       tags_all         = (known after apply)
+       vpc_id           = (known after apply)
    }

  # module.complete.aws_route_table_association.private will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.complete.aws_route_table_association.public will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.complete.aws_secretsmanager_secret.config_backup_password will be created
+   resource "aws_secretsmanager_secret" "config_backup_password" {
+       arn                            = (known after apply)
+       force_overwrite_replica_secret = false
+       id                             = (known after apply)
+       name                           = (known after apply)
+       name_prefix                    = (known after apply)
+       policy                         = (known after apply)
+       recovery_window_in_days        = 0
+       rotation_enabled               = (known after apply)
+       rotation_lambda_arn            = (known after apply)
+       tags                           = {
+           "logical-id" = "PasswordSecret"
        }
+       tags_all                       = {
+           "logical-id" = "PasswordSecret"
        }

+       replica {
+           kms_key_id         = (known after apply)
+           last_accessed_date = (known after apply)
+           region             = (known after apply)
+           status             = (known after apply)
+           status_message     = (known after apply)
        }

+       rotation_rules {
+           automatically_after_days = (known after apply)
        }
    }

  # module.complete.aws_secretsmanager_secret.console_password will be created
+   resource "aws_secretsmanager_secret" "console_password" {
+       arn                            = (known after apply)
+       force_overwrite_replica_secret = false
+       id                             = (known after apply)
+       name                           = (known after apply)
+       name_prefix                    = (known after apply)
+       policy                         = (known after apply)
+       recovery_window_in_days        = 0
+       rotation_enabled               = (known after apply)
+       rotation_lambda_arn            = (known after apply)
+       tags                           = {
+           "logical-id" = "PasswordSecret"
        }
+       tags_all                       = {
+           "logical-id" = "PasswordSecret"
        }

+       replica {
+           kms_key_id         = (known after apply)
+           last_accessed_date = (known after apply)
+           region             = (known after apply)
+           status             = (known after apply)
+           status_message     = (known after apply)
        }

+       rotation_rules {
+           automatically_after_days = (known after apply)
        }
    }

  # module.complete.aws_secretsmanager_secret.secure_storage_master_key will be created
+   resource "aws_secretsmanager_secret" "secure_storage_master_key" {
+       arn                            = (known after apply)
+       force_overwrite_replica_secret = false
+       id                             = (known after apply)
+       name                           = (known after apply)
+       name_prefix                    = (known after apply)
+       policy                         = (known after apply)
+       recovery_window_in_days        = 0
+       rotation_enabled               = (known after apply)
+       rotation_lambda_arn            = (known after apply)
+       tags                           = {
+           "logical-id" = "PasswordSecret"
        }
+       tags_all                       = {
+           "logical-id" = "PasswordSecret"
        }

+       replica {
+           kms_key_id         = (known after apply)
+           last_accessed_date = (known after apply)
+           region             = (known after apply)
+           status             = (known after apply)
+           status_message     = (known after apply)
        }

+       rotation_rules {
+           automatically_after_days = (known after apply)
        }
    }

  # module.complete.aws_secretsmanager_secret_version.config_backup_password will be created
+   resource "aws_secretsmanager_secret_version" "config_backup_password" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       secret_id      = (known after apply)
+       secret_string  = (sensitive value)
+       version_id     = (known after apply)
+       version_stages = (known after apply)
    }

  # module.complete.aws_secretsmanager_secret_version.console_password will be created
+   resource "aws_secretsmanager_secret_version" "console_password" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       secret_id      = (known after apply)
+       secret_string  = (sensitive value)
+       version_id     = (known after apply)
+       version_stages = (known after apply)
    }

  # module.complete.aws_secretsmanager_secret_version.secure_storage_master_key will be created
+   resource "aws_secretsmanager_secret_version" "secure_storage_master_key" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       secret_id      = (known after apply)
+       secret_string  = (sensitive value)
+       version_id     = (known after apply)
+       version_stages = (known after apply)
    }

  # module.complete.aws_security_group.lan[0] will be created
+   resource "aws_security_group" "lan" {
+       arn                    = (known after apply)
+       description            = "Security Group for private subnet. Allow everything by default"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       name                   = "Private Subnet"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = (known after apply)
+       tags_all               = (known after apply)
+       vpc_id                 = (known after apply)
    }

  # module.complete.aws_security_group.public[0] will be created
+   resource "aws_security_group" "public" {
+       arn                    = (known after apply)
+       description            = "Untrusted network restricted from access port 22 and 4444"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow all traffic outbound"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow public access 0 - 21"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 21
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow public access 23 - 4443"
+               from_port        = 23
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 4443
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow public access 4445 - 65535"
+               from_port        = 4445
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 65535
            },
        ]
+       name                   = "Public"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = (known after apply)
+       tags_all               = (known after apply)
+       vpc_id                 = (known after apply)
    }

  # module.complete.aws_security_group.trusted[0] will be created
+   resource "aws_security_group" "trusted" {
+       arn                    = (known after apply)
+       description            = "Enable TCP access from trusted network"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow all traffic outbound"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "47.184.79.94/32",
+                   "20.7.135.103/32",
                ]
+               description      = "Allow all from trusted IP"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 65535
            },
        ]
+       name                   = "Trusted Network"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = (known after apply)
+       tags_all               = (known after apply)
+       vpc_id                 = (known after apply)
    }

  # module.complete.aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-west-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = (known after apply)
+       tags_all                                       = (known after apply)
+       vpc_id                                         = (known after apply)
    }

  # module.complete.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-west-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.0.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = (known after apply)
+       tags_all                                       = (known after apply)
+       vpc_id                                         = (known after apply)
    }

  # module.complete.aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_classiclink                   = (known after apply)
+       enable_classiclink_dns_support       = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = (known after apply)
+       tags_all                             = (known after apply)
    }

  # module.complete.random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 1
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
+       prefix      = "SOPHOS_CNF-"
    }

  # module.key-pair.aws_key_pair.this[0] will be created
+   resource "aws_key_pair" "this" {
+       arn             = (known after apply)
+       fingerprint     = (known after apply)
+       id              = (known after apply)
+       key_name        = (known after apply)
+       key_name_prefix = (known after apply)
+       key_pair_id     = (known after apply)
+       key_type        = (known after apply)
+       public_key      = (known after apply)
+       tags_all        = (known after apply)
    }

  # module.key-pair.tls_private_key.this[0] will be created
+   resource "tls_private_key" "this" {
+       algorithm                     = "RSA"
+       ecdsa_curve                   = "P224"
+       id                            = (known after apply)
+       private_key_openssh           = (sensitive value)
+       private_key_pem               = (sensitive value)
+       private_key_pem_pkcs8         = (sensitive value)
+       public_key_fingerprint_md5    = (known after apply)
+       public_key_fingerprint_sha256 = (known after apply)
+       public_key_openssh            = (known after apply)
+       public_key_pem                = (known after apply)
+       rsa_bits                      = 4096
    }

Plan: 32 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   archive_name          = "7517866eb05f876f45c1f92f4725f6c55a51fdd7"
+   availability_zone_map = {
+       us-west-1b = "usw1-az3"
+       us-west-1c = "usw1-az1"
    }
+   private_key           = (sensitive value)
+   public_dns            = (known after apply)
+   public_ip             = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

```

No changes. No objects need to be destroyed.

Either you have not created any objects yet or the existing objects were
already deleted outside of Terraform.

Destroy complete! Resources: 0 destroyed.

```